<a href="https://colab.research.google.com/github/manju1983/DataScience/blob/main/Titanic_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This is the link from where I learn this analysis

https://github.com/mrdbourke/your-first-kaggle-submission/blob/master/kaggle-titanic-dataset-example-submission-workflow.ipynb

In [1]:
#import dependencies
%matplotlib inline

In [2]:
# Start Python Imports
import math, time, random, datetime

In [4]:
#Data manupulation Libraries
import pandas as pd
import numpy as np

In [6]:
# Visualization Libraries
import matplotlib.pyplot as plt
import missingno
import seaborn as sns
plt.style.use('seaborn-whitegrid')

In [7]:
#preprocessing
from sklearn.preprocessing import OneHotEncoder, LabelEncoder, label_binarize

In [10]:
#machine learning libraries
#import catboost
from sklearn.model_selection import train_test_split
from sklearn import  model_selection, tree, preprocessing, metrics, linear_model
from sklearn.svm import LinearSVC
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import LinearRegression, LogisticRegression, SGDClassifier
from sklearn.tree import DecisionTreeClassifier
#from catboost import Catboostclissifier, Pool, cv

In [11]:
# Ignore warnings
import warnings
warnings.filterwarnings('ignore')

**Loading the data**

We are loading the data from github

In [12]:
test = pd.read_csv('https://raw.githubusercontent.com/manju1983/DataScience/main/test.csv')
train = pd.read_csv('https://raw.githubusercontent.com/manju1983/DataScience/main/train.csv')

In [14]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [15]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [20]:
submission_gender = pd.read_csv('https://raw.githubusercontent.com/manju1983/DataScience/main/gender_submission.csv')

In [21]:
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1